Tekla Open API Reference for Tekla Structures 2025
PourObject.GetSolid Method
 Returns the solid of the pour object.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Solid GetSolid()
Public Function GetSolid As Solid
Return Value
Type: Solid
The solid of the pour object.
See Also
Reference
PourObject Class
Tekla.Structures.Model Namespace